In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# 6.1.   Odczyt i zapis danych w formacie tekstowym 177

In [5]:
df = pd.read_csv('przyklady/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('przyklady/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('przyklady/ex2.csv',names = ['a','b','c','d','messages'])

   a   b   c   d messages
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [9]:
# i want - column message -> index dataframe

pd.read_csv('przyklady/ex2.csv',names = ['a','b','c','d','messages'],index_col='messages')

          a   b   c   d
messages
hello     1   2   3   4
world     5   6   7   8
foo       9  10  11  12

In [12]:
# index hierarchiczny


pd.read_csv('przyklady/csv_mindex.csv',index_col=['key1','key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
# separator tabulator

pd.read_table('przyklady/ex3.txt', sep='\s+')

   aaa  -0.244  1.123
0  bbb  -0.234  0.123
1  ccc  -0.876  0.123

In [16]:
pd.read_csv('przyklady/ex4.csv',skiprows=[0,3,6])

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [20]:
result = pd.read_csv('przyklady/ex5.csv')
result

  something  a   b     x   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
pd.isnull(result)

   something      a      b      x      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [23]:
result = pd.read_csv('przyklady/ex5.csv',na_values=['NULL'])
result

  something  a   b     x   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
result2 = pd.read_csv('przyklady/ex5.csv',keep_default_na=False) # zostawił puste
result2

  something  a   b   x   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [25]:
result2.isna() # spr

   something      a      b      x      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [26]:
result3 = pd.read_csv('przyklady/ex5.csv',keep_default_na=False,na_values=['NA']) 
result3

  something  a   b   x   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [27]:
result3.isna()

   something      a      b      x      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [32]:
# slowniki do czyszczenia danych

sentinels = {'message':['foo','NA'],'something':['two']}

In [33]:
result4 = pd.read_csv('przyklady/ex5.csv',keep_default_na=False,na_values=sentinels) 
result4

  something  a   b   x   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Wczytywanie części pliku tekstowego 184

In [34]:
# pd options ustawienie 

pd.options.display.max_rows = 10

In [35]:
result4

  something  a   b   x   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

## Zapis danych w formacie tekstowym 185

In [37]:
result4.to_csv('przyklady/out.csv')  # export to csv

In [42]:
import sys  # display

result4.to_csv(sys.stdout,sep='|')

|something|a|b|x|d|message
0|one|1|2|3|4|
1||5|6||8|world
2|three|9|10|11|12|

## Praca z plikami danych rozgraniczonych 187



## Dane w formacie JSON 189 
## XML i HTML — web scraping 190

# 6.2.   Formaty danych binarnych 194 
## Wczytywanie plików programu Microsoft Excel 195 
## Obsługa formatu HDF5 196 

# 6.3.   Obsługa interfejsów sieciowych 198 
# 6.4.   Obsługa baz danych 200 
# 6.5.   Podsumowanie 202